# -*- mode: org -*-
* Version

#+BEGIN_SRC emacs-lisp
emacs-version
#+END_SRC

#+RESULTS:
: 26.3

** Capture

Configure my capture template!

When I do the following task, I use =C-c c= to capture it, including:
- recording a task
- a meeting
- do a journal entry of the day

Capture symbols
- =%?= test to entry
- =%U= gets this [2019-09-14 Sat 14:50]
- =%^U= prompts the schedule selector
- =%^G= interactively asking for tag

#+BEGIN_SRC emacs-lisp
(setq org-capture-templates
      (quote (("t" "Task")
              ("tt" "TODO" entry
               (file+headline org-default-notes-file "new")
               "* TODO %?\nSCHEDULED: %^U\n %^{Effort}p \n")
              ("tf" "FOLLOWUP" entry
               (file+headline org-default-notes-file "new")
               "* FOLLOWUP %?\nSCHEDULED: %^U")
              ("td" "DONE" entry
               (file+headline org-default-notes-file "new")
               "* DONE %?\nCLOSED: %U")

              ("m" "Meeting" entry
               (file org-default-notes-file "meeting")
               "* MEETING Meet with %? \nSCHEDULED: %^U")

              ("r" "Read")
              ("rc" "Important" entry
               (file+headline org-default-notes-file "read")
               "* TODO [#A] Read %? \n")
              ("rn" "Normal" entry
               (file+headline "~/Documents/yizhe/index.org" "read")
               "* TODO Read %?")

              ("j" "Journal" entry
               (file+datetree "~/Documents/yizhe/logbook.org")
               "* %?\n")
              )))


#+END_SRC

#+RESULTS:
| t | Task | entry | (file+headline ~/Documents/yizhe/index.org new) | * TODO %? |

